p2_script.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="PHP" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="-1751268693">
            <stringProp name="1572">15</stringProp>
            <stringProp name="0">0</stringProp>
            <stringProp name="1572">15</stringProp>
            <stringProp name="1568219">3185</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-111861430">
            <stringProp name="1634">35</stringProp>
            <stringProp name="51544">415</stringProp>
            <stringProp name="1634">35</stringProp>
            <stringProp name="1544096">2750</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-40023522">
            <stringProp name="1691">50</stringProp>
            <stringProp name="55507">850</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="1540097">2300</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-2039012164">
            <stringProp name="48625">100</stringProp>
            <stringProp name="1510306">1300</stringProp>
            <stringProp name="48625">100</stringProp>
            <stringProp name="1515111">1800</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1669832964">
            <stringProp name="49586">200</stringProp>
            <stringProp name="1515111">1800</stringProp>
            <stringProp name="49586">200</stringProp>
            <stringProp name="1509345">1200</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-2043735223">
            <stringProp name="51508">400</stringProp>
            <stringProp name="1541058">2400</stringProp>
            <stringProp name="51508">400</stringProp>
            <stringProp name="51508">400</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">virtual.lab.inf.uva.es</stringProp>
          <stringProp name="HTTPSampler.port">31402</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">600000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">600000</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">${__P(ENDPOINT,/test/phptestotal.php)}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">600000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">600000</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <kg.apc.jmeter.perfmon.PerfMonCollector guiclass="kg.apc.jmeter.vizualizers.PerfMonGui" testclass="kg.apc.jmeter.perfmon.PerfMonCollector" testname="jp@gc - PerfMon Metrics Collector" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${__P(FILE,perfmon.jtl)}</stringProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
          <collectionProp name="metricConnections">
            <collectionProp name="-1765883115">
              <stringProp name="820435565">virtual.lab.inf.uva.es</stringProp>
              <stringProp name="48609943">31404</stringProp>
              <stringProp name="66952">CPU</stringProp>
            </collectionProp>
            <collectionProp name="-1245022190">
              <stringProp name="820435565">virtual.lab.inf.uva.es</stringProp>
              <stringProp name="48609943">31404</stringProp>
              <stringProp name="-1993889503">Memory</stringProp>
              <stringProp name="-278579165">usedperc</stringProp>
            </collectionProp>
            <collectionProp name="1755933261">
              <stringProp name="820435565">virtual.lab.inf.uva.es</stringProp>
              <stringProp name="48609943">31404</stringProp>
              <stringProp name="2112896831">Disks I/O</stringProp>
              <stringProp name="108386717">reads</stringProp>
            </collectionProp>
            <collectionProp name="-756249113">
              <stringProp name="820435565">virtual.lab.inf.uva.es</stringProp>
              <stringProp name="48609943">31404</stringProp>
              <stringProp name="2112896831">Disks I/O</stringProp>
              <stringProp name="-779574156">writes</stringProp>
            </collectionProp>
            <collectionProp name="887903151">
              <stringProp name="820435565">virtual.lab.inf.uva.es</stringProp>
              <stringProp name="48609943">31404</stringProp>
              <stringProp name="2590131">Swap</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.perfmon.PerfMonCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>